In [41]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier

In [42]:
train = pd.read_csv("C:/Users/79851/kal/Untitled Folder/train.csv")
test = pd.read_csv("C:/Users/79851/kal/Untitled Folder/test.csv")
gensub = pd.read_csv("C:/Users/79851/kal/Untitled Folder/gender_submission.csv")

In [43]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [44]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [45]:
gensub.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [46]:
women = train.loc[train['Sex'] == 'female']['Survived']
rate_women = sum(women)/len(women)
print('% of women survived: ',rate_women)
women

% of women survived:  0.7420382165605095

1      1
2      1
3      1
8      1
9      1
      ..
880    1
882    0
885    0
887    1
888    0
Name: Survived, Length: 314, dtype: int64

In [47]:
men = train.loc[train['Sex'] == 'male']['Survived']
rate_men = sum(men)/len(men)
print('% of men survived: ',rate_men)
women

% of men survived:  0.18890814558058924

1      1
2      1
3      1
8      1
9      1
      ..
880    1
882    0
885    0
887    1
888    0
Name: Survived, Length: 314, dtype: int64

In [51]:
y =  train['Survived']
features = ['Pclass', 'Sex', 'SibSp', 'Parch']
X = pd.get_dummies(train[features])
X_test = pd.get_dummies(test[features])

In [52]:
model = RandomForestClassifier(n_estimators = 100, max_depth = 5, random_state = 1)
model.fit(X,y)
model_predictions = model.predict(X_test)

In [54]:
output = pd.DataFrame({'PassengerID':test.PassengerId, 'Survived': model_predictions})
output.head()

   PassengerID  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [55]:
output.to_csv('submission.csv', index = False)
print('Submission saved!')

Submission saved!

In [57]:
output.shape

(418, 2)